In [2]:
import pandas as pd
var=pd.DataFrame({"Name":["a","b","c","d","a","b","c","c","a"],
                  "Subject1":[1,2,3,44,55,66,77,21,32],
                  "Subject2":[44,22,44,66,88,545,333,32,12]})
var

  Name  Subject1  Subject2
0    a         1        44
1    b         2        22
2    c         3        44
3    d        44        66
4    a        55        88
5    b        66       545
6    c        77       333
7    c        21        32
8    a        32        12

In [3]:
var_1=var.groupby("Name")
var_1

In [5]:
for x,y in var_1:
    print(x)
    print(y)
    print()

a
  Name  Subject1  Subject2
0    a         1        44
4    a        55        88
8    a        32        12

b
  Name  Subject1  Subject2
1    b         2        22
5    b        66       545

c
  Name  Subject1  Subject2
2    c         3        44
6    c        77       333
7    c        21        32

d
  Name  Subject1  Subject2
3    d        44        66

To get only group "b"

In [6]:
var_1.get_group("a")

  Name  Subject1  Subject2
0    a         1        44
4    a        55        88
8    a        32        12

To get only group b

In [7]:
var_1.get_group("b")

  Name  Subject1  Subject2
1    b         2        22
5    b        66       545

To get minimum element

In [8]:
var_1.min()

      Subject1  Subject2
Name
a            1        12
b            2        22
c            3        32
d           44        66

To get maximum element

In [9]:
var_1.max()

      Subject1  Subject2
Name
a           55        88
b           66       545
c           77       333
d           44        66